In [74]:
import pandas as pd
import numpy as np
import seaborn as sns

In [75]:
df = pd.DataFrame({'A': ['a', 'b', 'a'], 'B': ['b', 'a', 'c'], 'C': [1, 2, 3]})

In [76]:
df

   A  B  C
0  a  b  1
1  b  a  2
2  a  c  3

In [73]:
pd.get_dummies(df, prefix=['col1', 'col2'])   # or prefix=['col1', 'col2']

   C  col1_a  col1_b  col2_a  col2_b  col2_c
0  1       1       0       0       1       0
1  2       0       1       1       0       0
2  3       1       0       0       0       1

In [77]:
temp = df
temp.A = temp.A.map({'a': 0, 'b': 1, 'c': 2})
temp

   A  B  C
0  0  b  1
1  1  a  2
2  0  c  3

In [106]:
df = sns.load_dataset('titanic')

In [107]:
pd.crosstab(index=df.sex, columns="count", margins=True)

col_0   count  All
sex
female    314  314
male      577  577
All       891  891

In [108]:
pd.crosstab(index=df["alive"], columns=df["sex"], margins=True)

sex    female  male  All
alive
no         81   468  549
yes       233   109  342
All       314   577  891

In [109]:
pd.crosstab(index=df["alive"], columns=df["sex"])

sex    female  male
alive
no         81   468
yes       233   109

In [110]:
temp = pd.crosstab(index=df["alive"], columns=[df["pclass"], df["sex"]], margins=True)
temp

pclass      1           2           3       All
sex    female male female male female male
alive
no          3   77      6   91     72  300  549
yes        91   45     70   17     72   47  342
All        94  122     76  108    144  347  891

In [111]:
prob = temp/temp.loc["All"] # Probability

In [112]:
prob

pclass         1                   2                3                 All
sex       female      male    female      male female      male
alive
no      0.031915  0.631148  0.078947  0.842593    0.5  0.864553  0.616162
yes     0.968085  0.368852  0.921053  0.157407    0.5  0.135447  0.383838
All     1.000000  1.000000  1.000000  1.000000    1.0  1.000000  1.000000

In [114]:
prob.loc['no']

pclass  sex
1       female    0.031915
        male      0.631148
2       female    0.078947
        male      0.842593
3       female    0.500000
        male      0.864553
All               0.616162
Name: no, dtype: float64

In [96]:
df = pd.DataFrame({'A': ['a', 'b', 'a'], 'B': ['b', 'a', 'c'], 'C': [1, 2, 3]})

In [97]:
df

   A  B  C
0  a  b  1
1  b  a  2
2  a  c  3

In [104]:
temp = df.stack()
temp = pd.DataFrame(temp)
temp = x.reset_index()
temp = temp.drop(columns=['index', 'level_0'])
temp.columns = ['column', 'value']

In [103]:
temp

  column value
0      A     0
1      B     b
2      C     1
3      A     1
4      B     a
5      C     2
6      A     0
7      B     c
8      C     3